Configuration File

* Parinfer - Auto Indentation & Paren Closing For Lisp (AWESOME PACKAGE!!!)
#+BEGIN_SRC emacs-lisp
(use-package parinfer :ensure t)

(evil-leader/set-key "s" 'parinfer-toggle-mode)

(add-hook 'clojure-mode-hook #'parinfer-mode)
(add-hook 'clojurescript-mode-hook #'parinfer-mode)

#+END_SRC

#+RESULTS:
| parinfer-mode |

* Window Management (Shackle Replacement)

https://www.gnu.org/software/emacs/manual/html_node/elisp/Frame-Layouts-with-Side-Windows.html

#+BEGIN_SRC emacs-lisp

(setq helm-display-function 'pop-to-buffer) ; make helm play nice

(defvar parameters
       '(window-parameters . ((no-other-window . t)
                              (no-delete-other-windows . t))))

(setq fit-window-to-buffer-horizontally t)
(setq window-resize-pixelwise t)

(setq display-buffer-alist
        `( 
        ("\\*Buffer List\\*" display-buffer-in-side-window
         (side . top) (slot . 0) (window-height . fit-window-to-buffer)
         (preserve-size . (nil . t)) ,parameters)

( ,(rx bos "*helm*" eos)
           (display-buffer-reuse-window
            display-buffer-in-side-window)
           (side            . bottom)
           (window-height   . 0.4))


          (,(rx bos "*cscope*" eos)
          (display-buffer-reuse-window
           display-buffer-in-side-window)
          (side            . bottom)
          (window-height   . 0.4))

          (,(rx bos "*shell*")
            (display-buffer-reuse-window
             display-buffer-in-side-window)
            (side            . bottom)
            (slot . 1)
            (window-height   . 0.4))


         ( ,(rx bos "*ag search*" eos)
           (display-buffer-reuse-window
            display-buffer-in-side-window)
           (slot . -1 )
           (side            . bottom)
           (window-height   . 0.4))

         ;( ,(rx bos "magit")
         ;  (display-buffer-reuse-window
         ;   display-buffer-pop-up-frame)
         ;  (reusable-frames . 0))

         ;( ,(rx (or ".py" ".c" ".php" ".xml" ".md" ".cpp" ".rb" ".java" ".txt" ".h") eos)
         ;  (display-buffer-reuse-window
         ;   display-buffer-in-side-window)
         ;  (reusable-frames . visible)
         ;  (side            . top)
         ;  (window-height   . 0.4))

))

;;; Selects the window that's hopefully at the location returned by
;;; `windmove-other-window-loc', or screams if there's no window there.
;(defun jt-windmove-do-window-select (dir &optional arg window)
;  "Move to the window at direction DIR.
;DIR, ARG, and WINDOW are handled as by `windmove-other-window-loc'.
;If no window is at direction DIR, an error is signaled."
;  (let ((other-window (windmove-find-other-window dir arg window)))
;    (cond ((null other-window)
;           ;Following modified by justin.
;           ;left and right directions should follow different behavior.
;           (cond ((eq dir 'left) (previous-buffer))
;                 ((eq dir 'right) (next-buffer))
;                 ((user-error "huh %s" dir))))
;          ((and (window-minibuffer-p other-window)
;                (not (minibuffer-window-active-p other-window)))
;           (user-error "Minibuffer is inactive"))
;          (t
;           (select-window other-window)))))
;
;
;(evil-define-command jt-evil-window-left (count)
;  "Move the cursor to new COUNT-th window left of the current one."
;  :repeat nil
;  (interactive "p")
;  (my-with-patch-function 'windmove-do-window-select  (dir &optional arg window) (jt-windmove-do-window-select dir arg window)
;    (dotimes (i count)
;
;      (windmove-left))))
;      
;
;(evil-define-command jt-evil-window-right (count)
;  "Move the cursor to new COUNT-th window right of the current one."
;  :repeat nil
;  (interactive "p")
;  (my-with-patch-function 'windmove-do-window-select  (dir &optional arg window) (jt-windmove-do-window-select dir arg window)
;    (dotimes (i count)
;
;      (windmove-right))))
;          
;(define-key evil-motion-state-map  (kbd "<up>") 'evil-window-up)
;(define-key evil-motion-state-map  (kbd "<right>") 'jt-evil-window-right)
;(define-key evil-motion-state-map  (kbd "<left>") 'jt-evil-window-left)
;(define-key evil-motion-state-map  (kbd "<down>") 'evil-window-down)

#+END_SRC

#+RESULTS:
| \*Buffer List\*   | display-buffer-in-side-window                               | (side . top)          | (slot . 0)            | (window-height . fit-window-to-buffer) | (preserve-size nil . t) | (window-parameters (no-other-window . t) (no-delete-other-windows . t)) |
| \`\*helm\*\'      | (display-buffer-reuse-window display-buffer-in-side-window) | (side . bottom)       | (window-height . 0.4) |                                        |                         |                                                                         |
| \`\*cscope\*\'    | (display-buffer-reuse-window display-buffer-in-side-window) | (side . bottom)       | (window-height . 0.4) |                                        |                         |                                                                         |
| \`\*shell\*       | (display-buffer-reuse-window display-buffer-in-side-window) | (side . bottom)       | (slot . 1)            | (window-height . 0.4)                  |                         |                                                                         |
| \`\*ag search\*\' | (display-buffer-reuse-window display-buffer-in-side-window) | (slot . -1)           | (side . bottom)       | (window-height . 0.4)                  |                         |                                                                         |
| \`magit           | (display-buffer-reuse-window display-buffer-pop-up-frame)   | (reusable-frames . 0) |                       |                                        |                         |                                                                         |



